common/models/CurrencySearch.php

SELECT COUNT(*) FROM `currency` WHERE (`date` >= '2022-04-07') AND (`date` <= '2022-04-14') AND (`charCode` = 'HKD')
---
    public function search($params)
    {

        $query = parent::find();

        $dataProvider = new ActiveDataProvider([
            'query' => $query,
            'pagination' => false
        ]);

        if (!($this->load($params) && $this->validate())) {
            print_r('adsdas');

            $pagination = new Pagination(['totalCount' => $query->count(),'pageSize' => 20]);
            $this->pagination = $pagination;
            $query->offset($pagination->offset)
                ->limit($pagination->limit);
            return $dataProvider;
        }

        if(!empty($this->from) && !empty($this->to)){
            $query->andWhere(['>=', 'date', $this->from])
                ->andWhere(['<=', 'date', $this->to]);
        }
        if(!empty($this->charCode)){
            $query->andWhere(['=','charCode', $this->charCode])
                ->orderBy(['date' => SORT_ASC]);
        }

        $pagination = new Pagination(['totalCount' => $query->count(),'pageSize' => 20]);